OdGsCollisionDetectionReactor.collisionDetected(OdGiPathNode!System.Runtime.CompilerServices.IsConst*,OdGiPathNode!System.Runtime.CompilerServices.IsConst*,System.Double)
\details
Notification function called whenever an collision detected if distance calsulation is specified
\param pPathNode1 [in]  Pointer to the OdGiPathNode object from OdGsView::collide input list
\param pPathNode2 [in]  Pointer to the OdGiPathNode object that collides with pathNode1
\param dDistace   [in]  Collision distance. If negative, it is the penetration depth. If positive, it is the clearance.
\remarks
Returns kContinue if the operation is to continue or kBreak to stop collision detection

OdGsCollisionDetectionReactor.collisionDetected(OdGiPathNode!System.Runtime.CompilerServices.IsConst*,OdGiPathNode!System.Runtime.CompilerServices.IsConst*)
\details
Notification function called whenever an collision detected.
\param pPathNode1 [in]  Pointer to the OdGiPathNode object from OdGsView::collide input list
\param pPathNode2 [in]  Pointer to the OdGiPathNode object that collides with pathNode1
\remarks
Returns kContinue if the operation is to continue or kBreak to stop collision detection